; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v1 ?v11)
             (pred_5 ?v12 ?v3)
             (pred_7 ?v1 ?v3)
             (pred_11 ?v2 ?v1 )
	     (pred_2 ?v1)
             (pred_4 ?v6)
             (pred_12 ?v12)
             (pred_1 ?v3)
             (pred_6 ?v1)
             (pred_8 ?v12)
             (pred_9 ?v1)
             (pred_10 ))



(:action op_1
:parameters (?v10 ?v4 ?v13 ?v9)
:precondition (and (pred_4 ?v10) (pred_4 ?v4) (pred_12 ?v13) (pred_1 ?v9)
          (pred_3 ?v10 ?v4) (pred_5 ?v13 ?v9)
                   (pred_7 ?v4 ?v9) (pred_2 ?v10) 
                   (pred_6 ?v4) (pred_8 ?v13))
:effect (and  (pred_9 ?v4) (not (pred_6 ?v4))))


(:action op_4
:parameters (?v10 ?v5)
:precondition (and (pred_4 ?v10) (pred_4 ?v5)
               (pred_2 ?v10) (pred_3 ?v10 ?v5) (pred_9 ?v5))
:effect (and (pred_2 ?v5) (not (pred_2 ?v10))))

(:action op_2
:parameters (?v10 ?v13)
:precondition (and (pred_4 ?v10) (pred_12 ?v13) 
                  (pred_2 ?v10) (pred_11 ?v13 ?v10) (pred_10 ))
:effect (and (pred_8 ?v13)
   (not (pred_11 ?v13 ?v10)) (not (pred_10 ))))


(:action op_3
:parameters (?v10 ?v8 ?v7)
:precondition (and (pred_4 ?v10) (pred_12 ?v8) (pred_12 ?v7)
                  (pred_2 ?v10) (pred_8 ?v7) (pred_11 ?v8 ?v10))
:effect (and (pred_8 ?v8) (pred_11 ?v7 ?v10)
        (not (pred_8 ?v7)) (not (pred_11 ?v8 ?v10))))

(:action op_5
:parameters (?v10 ?v13)
:precondition (and (pred_4 ?v10) (pred_12 ?v13) 
                  (pred_2 ?v10) (pred_8 ?v13))
:effect (and (pred_10 ) (pred_11 ?v13 ?v10) (not (pred_8 ?v13)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_04 obj_03 obj_17 obj_10 obj_21 obj_28 obj_14 obj_07 obj_27 obj_16 obj_18 obj_29 obj_06 obj_15 obj_19 obj_26 obj_11 obj_31 obj_32 obj_05 obj_20 obj_22 obj_08 obj_23 obj_09
    obj_12 obj_01 obj_24
    obj_13 obj_25 obj_02 obj_30
    )

    (:init
       (pred_10)

       (pred_4 obj_04)
       (pred_4 obj_03)
       (pred_4 obj_17)
       (pred_4 obj_10)
       (pred_4 obj_21)
       (pred_4 obj_28)
       (pred_4 obj_14)
       (pred_4 obj_07)
       (pred_4 obj_27)
       (pred_4 obj_16)
       (pred_4 obj_18)
       (pred_4 obj_29)
       (pred_4 obj_06)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_4 obj_26)
       (pred_4 obj_11)
       (pred_4 obj_31)
       (pred_4 obj_32)
       (pred_4 obj_05)
       (pred_4 obj_20)
       (pred_4 obj_22)
       (pred_4 obj_08)
       (pred_4 obj_23)
       (pred_4 obj_09)
       (pred_1 obj_12)
       (pred_1 obj_01)
       (pred_1 obj_24)
       (pred_12 obj_13)
       (pred_12 obj_25)
       (pred_12 obj_02)
       (pred_12 obj_30)

       (pred_3 obj_04 obj_28)
       (pred_3 obj_04 obj_03)
       (pred_3 obj_03 obj_14)
       (pred_3 obj_03 obj_17)
       (pred_3 obj_03 obj_04)
       (pred_3 obj_17 obj_07)
       (pred_3 obj_17 obj_10)
       (pred_3 obj_17 obj_03)
       (pred_3 obj_10 obj_27)
       (pred_3 obj_10 obj_21)
       (pred_3 obj_10 obj_17)
       (pred_3 obj_21 obj_16)
       (pred_3 obj_21 obj_10)
       (pred_3 obj_28 obj_18)
       (pred_3 obj_28 obj_14)
       (pred_3 obj_28 obj_04)
       (pred_3 obj_14 obj_29)
       (pred_3 obj_14 obj_07)
       (pred_3 obj_14 obj_03)
       (pred_3 obj_14 obj_28)
       (pred_3 obj_07 obj_06)
       (pred_3 obj_07 obj_27)
       (pred_3 obj_07 obj_17)
       (pred_3 obj_07 obj_14)
       (pred_3 obj_27 obj_15)
       (pred_3 obj_27 obj_16)
       (pred_3 obj_27 obj_10)
       (pred_3 obj_27 obj_07)
       (pred_3 obj_16 obj_19)
       (pred_3 obj_16 obj_21)
       (pred_3 obj_16 obj_27)
       (pred_3 obj_18 obj_26)
       (pred_3 obj_18 obj_29)
       (pred_3 obj_18 obj_28)
       (pred_3 obj_29 obj_11)
       (pred_3 obj_29 obj_06)
       (pred_3 obj_29 obj_14)
       (pred_3 obj_29 obj_18)
       (pred_3 obj_06 obj_31)
       (pred_3 obj_06 obj_15)
       (pred_3 obj_06 obj_07)
       (pred_3 obj_06 obj_29)
       (pred_3 obj_15 obj_32)
       (pred_3 obj_15 obj_19)
       (pred_3 obj_15 obj_27)
       (pred_3 obj_15 obj_06)
       (pred_3 obj_19 obj_05)
       (pred_3 obj_19 obj_16)
       (pred_3 obj_19 obj_15)
       (pred_3 obj_26 obj_20)
       (pred_3 obj_26 obj_11)
       (pred_3 obj_26 obj_18)
       (pred_3 obj_11 obj_22)
       (pred_3 obj_11 obj_31)
       (pred_3 obj_11 obj_29)
       (pred_3 obj_11 obj_26)
       (pred_3 obj_31 obj_08)
       (pred_3 obj_31 obj_32)
       (pred_3 obj_31 obj_06)
       (pred_3 obj_31 obj_11)
       (pred_3 obj_32 obj_23)
       (pred_3 obj_32 obj_05)
       (pred_3 obj_32 obj_15)
       (pred_3 obj_32 obj_31)
       (pred_3 obj_05 obj_09)
       (pred_3 obj_05 obj_19)
       (pred_3 obj_05 obj_32)
       (pred_3 obj_20 obj_22)
       (pred_3 obj_20 obj_26)
       (pred_3 obj_22 obj_08)
       (pred_3 obj_22 obj_11)
       (pred_3 obj_22 obj_20)
       (pred_3 obj_08 obj_23)
       (pred_3 obj_08 obj_31)
       (pred_3 obj_08 obj_22)
       (pred_3 obj_23 obj_09)
       (pred_3 obj_23 obj_32)
       (pred_3 obj_23 obj_08)
       (pred_3 obj_09 obj_05)
       (pred_3 obj_09 obj_23)
       (pred_6 obj_03)
       (pred_6 obj_29)
       (pred_6 obj_23)
       (pred_6 obj_26)
       (pred_7  obj_03 obj_12)
       (pred_7  obj_29 obj_01)
       (pred_7  obj_23 obj_24)
       (pred_7  obj_26 obj_24)
       (pred_9 obj_04)
       (pred_9 obj_17)
       (pred_9 obj_10)
       (pred_9 obj_21)
       (pred_9 obj_28)
       (pred_9 obj_14)
       (pred_9 obj_07)
       (pred_9 obj_27)
       (pred_9 obj_16)
       (pred_9 obj_18)
       (pred_9 obj_06)
       (pred_9 obj_15)
       (pred_9 obj_19)
       (pred_9 obj_11)
       (pred_9 obj_31)
       (pred_9 obj_32)
       (pred_9 obj_05)
       (pred_9 obj_20)
       (pred_9 obj_22)
       (pred_9 obj_08)
       (pred_9 obj_09)

       (pred_5  obj_13 obj_12)
       (pred_5  obj_25 obj_01)
       (pred_5  obj_02 obj_24)
       (pred_5  obj_30 obj_01)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_25 obj_09)
       (pred_11 obj_02 obj_09)
       (pred_11 obj_30 obj_11)
       (pred_2 obj_09)
    )

    (:goal (and
       (pred_11 obj_13 obj_05)
       (pred_11 obj_02 obj_04)
    ))
(:constraints
  (always (not (pred_2 obj_27)))
)
)

; plan
1. (op_2 obj_09 obj_02)
   deleted: (pred_11 obj_02 obj_09) (pred_10)
   added: (pred_8 obj_02)
   goals met: 0 of 2
2. (op_4 obj_09 obj_05)
   deleted: (pred_2 obj_09)
   added: (pred_2 obj_05)
   goals met: 0 of 2
3. (op_4 obj_05 obj_19)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_19)
   goals met: 0 of 2
4. (op_3 obj_19 obj_13 obj_02)
   deleted: (pred_8 obj_02) (pred_11 obj_13 obj_19)
   added: (pred_8 obj_13) (pred_11 obj_02 obj_19)
   goals met: 0 of 2
5. (op_4 obj_19 obj_05)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_05)
   goals met: 0 of 2
6. (op_5 obj_05 obj_13)
   deleted: (pred_8 obj_13)
   added: (pred_10) (pred_11 obj_13 obj_05)
   goals met: 1 of 2
7. (op_4 obj_05 obj_19)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_19)
   goals met: 1 of 2
8. (op_2 obj_19 obj_02)
   deleted: (pred_11 obj_02 obj_19) (pred_10)
   added: (pred_8 obj_02)
   goals met: 1 of 2
9. (op_4 obj_19 obj_15)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_15)
   goals met: 1 of 2
10. (op_4 obj_15 obj_06)
   deleted: (pred_2 obj_15)
   added: (pred_2 obj_06)
   goals met: 1 of 2
11. (op_4 obj_06 obj_07)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_07)
   goals met: 1 of 2
12. (op_4 obj_07 obj_14)
   deleted: (pred_2 obj_07)
   added: (pred_2 obj_14)
   goals met: 1 of 2
13. (op_4 obj_14 obj_28)
   deleted: (pred_2 obj_14)
   added: (pred_2 obj_28)
   goals met: 1 of 2
14. (op_4 obj_28 obj_04)
   deleted: (pred_2 obj_28)
   added: (pred_2 obj_04)
   goals met: 1 of 2
15. (op_5 obj_04 obj_02)
   deleted: (pred_8 obj_02)
   added: (pred_10) (pred_11 obj_02 obj_04)
   goals met: 2 of 2
